import first from '../assets/problemCategory/first.png'
import second from '../assets/problemCategory/second.jpg'
import third from '../assets/problemCategory/third.png'
import fourth from '../assets/problemCategory/fourth.jpg'
import fifth from '../assets/problemCategory/fifth.jpg'
import {PROBLEMS, PROBLEMS_2, PROBLEMS_3, PROBLEMS_4, PROBLEMS_5} from "./problems.ts";

const descriptionByCategory = new Map()
descriptionByCategory.set('кузов', {
  img: first,
  title: 'кузов',
  description:
    'Повністю перевіряємо силову частину кузова (дах, стійки, лонжерони, днище) та навісні елементи (крила, двері, капот і т.д.). Еталоном вважається кузов нового автомобіля, і все порівняння відбувається з ним. Досвідчений фахівець вже за загального візуального огляду побачить усі дефекти, вторинні забарвлення, замасковані ремонти тощо. Непомітні оку проблеми дозволить побачити товщиномір – прилад для виміру товщини фарби. Він покаже, чи перефарбована машина, чи є шпаклівка під фарбою тощо.',
  problems: PROBLEMS,
})
descriptionByCategory.set('електрика', {
  img: second,
  title: 'електрика',
  description:
    'Сучасні автомобілі буквально "напхані" електрикою, тому проблеми з нею зустрічаються досить часто. Під час діагностики наш спеціаліст візуально, на слух та за допомогою діагностичного сканера перевіряє як систему запалювання, освітлювальні прилади та приладову панель, так і електрообладнання для комфорту водія – кондиціювання, електропідйомники, аудіо- та відеосистеми, круїз-контроль та багато іншого.',
  problems: PROBLEMS_2,
})
descriptionByCategory.set('двигун/кпп', {
  img: third,
  title: 'двигун/кпп',
  description:
    'Фахівець виконує загальний огляд двигуна, заводить та слухає його. Якщо підозр не виникає, слід тест-драйв. Якщо нічого не виявилося під час тест-драйву, автомобіль вирушає на сервіс для детальної перевірки.',
  problems: PROBLEMS_3,
})
descriptionByCategory.set('гальмівна система', {
  img: fourth,
  title: 'гальмівна система',
  description:
    'Ми приділяємо особливу увагу перевірці гальмівної системи автомобіля, адже її стан – це питання вашої безпеки. Фахівець перевіряє загальний знос витратних частин гальмівної системи (диски та колодки), рівномірність цього зносу і оцінить термін служби, що залишився. Потім фахівець перевірить стан супортів та інших гальмівних механізмів, а також електронних систем (антиблокування, антипробуксування, антизанос).',
  problems: PROBLEMS_4,
})
descriptionByCategory.set('підвіска та ходова частина', {
  img: fifth,
  title: 'підвіска та ходова частина',
  description:
    'Більшість несправностей підвіски досвідчений фахівець легко виявить під час уважного огляду та тест-драйву. Виконується огляд гумових пильовиків та чохлів, діагностика амортизаторів, перевірка витоків масла, перевірка на люфт опор стабілізаторів, підшипників верхніх опор та тяги тощо. Якщо проблем не виявлено, автомобіль відправляється на сервісну станцію для комплексного огляду, який дозволить побачити кожний параметр кожної системи підвіски та покаже приховані несправності.',
  problems: PROBLEMS_5,
})

export { descriptionByCategory }
